print("ตรวจสอบเกรด")
a = int (input('โปรดใส่คะแนนของคุณ'))
if a < 0 or a > 100 :
    print ('กรุณากรอก 0 - 100')
elif a >= 80 : 
    print ("คุณได้เกรด 4")
elif a >= 70 : 
    print ("คุณได้เกรด 3")
elif a >= 60 : 
    print ("คุณได้เกรด 2")
elif a >= 50 : 
    print ("คุณได้เกรด 1")
else :
    print ("คุณได้เกรด 0")
    print ("ต้องการแก้หรือไหม ถ้าต้องการแก้พิม 1 หรือ ไม้ต้องการแก้พิม 2")
    b = int(input('กรุณาใส่ตัวเลือก'))
    if b == 1:
        a = 50 - a
        print(f'คุณขาดคะแนนอีก{a}')
    elif b == 2:
        print('สอบตกเหมือนเดิม')
    else :
        print('กรุณาเลือก 1 หรือ 2') 
     
